; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=30, out_folder=htg/blocksworld/training, instance_id=10, seed=2034, goal_proportion=0.1

(define (problem blocksworld-10)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b16)
    (on-table b16)
    (clear b24)
    (on b24 b11)
    (on b11 b21)
    (on b21 b6)
    (on b6 b9)
    (on b9 b14)
    (on b14 b27)
    (on-table b27)
    (clear b8)
    (on-table b8)
    (clear b30)
    (on b30 b23)
    (on b23 b22)
    (on b22 b13)
    (on b13 b5)
    (on b5 b25)
    (on b25 b28)
    (on b28 b20)
    (on b20 b7)
    (on b7 b1)
    (on b1 b10)
    (on b10 b4)
    (on b4 b18)
    (on b18 b2)
    (on b2 b19)
    (on b19 b26)
    (on b26 b17)
    (on b17 b29)
    (on b29 b12)
    (on b12 b3)
    (on-table b3))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b30 b23)
   deleted: (on b30 b23) (clear b30) (arm-empty)
   added: (holding b30) (clear b23)
   goals met: 1 of 4
2. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 1 of 4
3. (unstack b23 b22)
   deleted: (on b23 b22) (clear b23) (arm-empty)
   added: (holding b23) (clear b22)
   goals met: 1 of 4
4. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 1 of 4
5. (unstack b22 b13)
   deleted: (on b22 b13) (clear b22) (arm-empty)
   added: (holding b22) (clear b13)
   goals met: 1 of 4
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 4
7. (unstack b13 b5)
   deleted: (on b13 b5) (clear b13) (arm-empty)
   added: (holding b13) (clear b5)
   goals met: 1 of 4
8. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 4
9. (unstack b5 b25)
   deleted: (on b5 b25) (clear b5) (arm-empty)
   added: (holding b5) (clear b25)
   goals met: 1 of 4
10. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 4
11. (unstack b25 b28)
   deleted: (on b25 b28) (clear b25) (arm-empty)
   added: (holding b25) (clear b28)
   goals met: 1 of 4
12. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 4
13. (unstack b28 b20)
   deleted: (on b28 b20) (clear b28) (arm-empty)
   added: (holding b28) (clear b20)
   goals met: 1 of 4
14. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 4
15. (unstack b20 b7)
   deleted: (on b20 b7) (clear b20) (arm-empty)
   added: (holding b20) (clear b7)
   goals met: 1 of 4
16. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 4
17. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 2 of 4
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 4
19. (unstack b1 b10)
   deleted: (on b1 b10) (clear b1) (arm-empty)
   added: (holding b1) (clear b10)
   goals met: 1 of 4
20. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 4
21. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 2 of 4
22. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 4
23. (unstack b4 b18)
   deleted: (on b4 b18) (clear b4) (arm-empty)
   added: (holding b4) (clear b18)
   goals met: 2 of 4
24. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 4
25. (unstack b18 b2)
   deleted: (on b18 b2) (clear b18) (arm-empty)
   added: (holding b18) (clear b2)
   goals met: 2 of 4
26. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 4
27. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 2 of 4
28. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 4
29. (unstack b19 b26)
   deleted: (on b19 b26) (clear b19) (arm-empty)
   added: (holding b19) (clear b26)
   goals met: 2 of 4
30. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 4
31. (unstack b26 b17)
   deleted: (on b26 b17) (clear b26) (arm-empty)
   added: (holding b26) (clear b17)
   goals met: 2 of 4
32. (stack b26 b18)
   deleted: (clear b18) (holding b26)
   added: (arm-empty) (clear b26) (on b26 b18)
   goals met: 2 of 4
33. (unstack b17 b29)
   deleted: (on b17 b29) (clear b17) (arm-empty)
   added: (holding b17) (clear b29)
   goals met: 2 of 4
34. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 4
35. (unstack b29 b12)
   deleted: (on b29 b12) (clear b29) (arm-empty)
   added: (holding b29) (clear b12)
   goals met: 2 of 4
36. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 4
37. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 2 of 4
38. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 4
39. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 2 of 4
40. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 4
41. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 2 of 4
42. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
